/*
--- Нотатки ---

Тут будуть матриці поле боя для двох гравців. Зберігатись вони будуть як 2D масив 10 на 10.
Для перевіри результати ураження (поранив чи потопив) треба буде зробити bfs поки не пройдемо весь корабель, відслідковуючи чи є живі палуби.
Матриця матиме такі типи даних: пусто, палуба і уражена палуба. Чи може просто зберігати кораблі та їхні координати?

Після кожного попадання буде лінійний пошук по всій матриці, щоб з'ясувати, чи всі кораблі знищено

ID на полі:
0 - пусто
1 - палуби
2 - мертва палуба

Стадії гри: setup -> playing
*/

game = {
    "players": {
        "p1": {"ws": null, "board": generateEmptyBoard()},
        "p2": {"ws": null, "board": generateEmptyBoard()},
    },
    "toMove": "p1",
    "status": "setup"
}

function generateEmptyBoard() {
    board = []
    for (let i = 0; i < 10; i++) {
        board.push([]);
        for (let j = 0; j < 10; j++) {
            board[i].push(0);
        }
    }
    return board;
}
